HELYXcore-4.4.0/examples/legacy/multiphase/reactingTwoPhaseEulerFoam/RAS/wallBoiling/0/T.liquid
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "5";
    object      T.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 368;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 368;
    }
    outlet
    {
        type            inletOutlet;
        phi             phi.liquid;
        inletValue      uniform 368;
        value           uniform 368;
    }
    wall1
    {
        type            zeroGradient;
    }
    wall2
    {
        type            fixedMultiPhaseHeatFlux;
        relax           0.5;
        q               uniform 0;
        phase           "liquid";
        value           uniform 368;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
